{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend canister with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting security vulnerabilities and accessibility issues across authentication, XSS prevention, localStorage encryption, state validation, and ARIA compliance with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend components including security fixes (XSS sanitization, input validation), accessibility improvements (ARIA labels, keyboard navigation), and UI enhancements (cyber-themed styling, animations, educational tooltips).",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining color tokens for UI elements including cyber-themed accent colors and sidebar styling.",
  "frontend/index.html": "HTML entry point for the Keylogger Awareness Tool application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring React Router, React Query, theme provider, error boundary, and applying appearance preferences (reduced motion, density) to the DOM.",
  "frontend/src/components/AdminDemoModeToggle.tsx": "Toggle button for switching attacker dashboard view on/off with proper ARIA pressed state, accessibility labels, and help tooltip explaining the demo-only local visualization.",
  "frontend/src/components/AIRiskDetectorPanel.tsx": "AI risk detection panel displaying threat meter, typing speed, and pattern score with cyber-themed styling, progress bars with glow effects, and educational tooltips explaining the local heuristic simulation.",
  "frontend/src/components/AnimatedInfographics.tsx": "Canvas-based animated data flow visualization overlay for keylogger types infographic with proper animation frame cleanup to prevent memory leaks.",
  "frontend/src/components/AppearanceExperiencePanel.tsx": "Settings panel for customizing theme (dark/light mode), reduced motion preference, and layout density (comfortable/compact) with all preferences saved locally in browser storage.",
  "frontend/src/components/AttackerDashboardPanel.tsx": "Renders a simulated attacker view showing captured keystroke stream and reconstructed text with transmission animation, sanitizing all displayed input for safety.",
  "frontend/src/components/AttackSimulationTimeline.tsx": "Displays a 5-stage visual timeline (User Types → Keylogger Captures → Data Transmitted → Antivirus Detects → Threat Blocked) with animated progress bar and stage icons that activate based on simulation state.",
  "frontend/src/components/AutoBlockingAlert.tsx": "Shows an animated alert panel when auto-blocking is triggered, displaying a threat-blocked message with a reset button to continue the demo.",
  "frontend/src/components/AwarenessQuiz.tsx": "Interactive 5-question quiz component about keyloggers with multiple-choice answers, explanations, scoring, and navigation to restart or return to dashboard.",
  "frontend/src/components/DashboardHeroIntro.tsx": "Hero section with background image, educational badge, main heading, description, and a quick-start guide showing numbered steps for using the simulation.",
  "frontend/src/components/DisclaimerBanner.tsx": "Top banner with warning icon displaying educational disclaimer that clarifies the simulation runs locally in-browser with no real data capture or transmission.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary class component that catches rendering errors and displays a fallback UI with error details in dev mode and reset/refresh options.",
  "frontend/src/components/HelpTooltip.tsx": "Reusable tooltip wrapper component using shadcn/ui Tooltip primitives with configurable positioning (side/align) and delay.",
  "frontend/src/components/InContextWarning.tsx": "Small info box component with icon displaying contextual warning messages in a styled container with border and background.",
  "frontend/src/components/Layout.tsx": "Main layout component with header navigation, mobile menu, cyber-themed background decoration, and disclaimer banner. Renders child routes via Outlet and provides navigation between Dashboard and Awareness pages.",
  "frontend/src/components/ModuleInfoPopover.tsx": "Popover component that displays module information with a title and description when an info icon button is clicked. Optionally wraps the button in a HelpTooltip for additional context.",
  "frontend/src/components/OnboardingOverlay.tsx": "Multi-step onboarding overlay that guides users through the keylogger awareness tool features, including privacy notices, demo input area, attacker view panel, AI risk detector, and test scenarios. Displays educational content with icons for each step.",
  "frontend/src/components/ReportGeneratorButton.tsx": "Button component that generates and downloads a local PDF/text report of the simulation state, including peak risk, scan count, captured keystrokes, and reconstructed text. Uses the reportGenerator utility and displays toast notifications.",
  "frontend/src/components/RotatingDashboardCard.tsx": "Wrapper component that applies 3D rotation effects to dashboard cards on mouse hover, creating an interactive tilt effect based on cursor position. Includes keyboard focus handling without tilt.",
  "frontend/src/components/ScenarioQuiz.tsx": "Interactive quiz component for scenario-based learning with multiple-choice questions, answer submission, explanations, and score calculation. Displays results with review of correct/incorrect answers and retry functionality.",
  "frontend/src/components/ScenarioQuizModal.tsx": "Modal wrapper for ScenarioQuiz that handles accessibility features including focus trapping, keyboard navigation (Escape/Tab), and restoring focus on close. Fetches quiz data by scenario ID and displays error state if unavailable.",
  "frontend/src/components/ScenarioVideoModal.tsx": "Modal component for displaying scenario-related video content (file appears truncated in provided content).",
  "frontend/src/components/SimulatedAntivirusScanner.tsx": "Displays a simulated antivirus scanner UI with scan, quarantine, and removal actions for detected threats. Uses simulation state to manage scanning status and threat lifecycle.",
  "frontend/src/components/SimulatedCounters.tsx": "Shows three counter cards displaying keystrokes captured, scans performed, and blocks executed from the simulation state.",
  "frontend/src/components/SimulatedKeyloggerModule.tsx": "Provides a demo textarea input area that simulates keylogger capture locally in the browser. Includes warnings and can be disabled when blocked.",
  "frontend/src/components/SimulationSettingsPanel.tsx": "Empty file with no content.",
  "frontend/src/components/TestScenariosPanel.tsx": "Displays a grid of prebuilt test scenarios with educational content, quizzes, and collapsible learning materials. Manages scenario selection and quiz modal state.",
  "frontend/src/components/ThreatMeter3D.tsx": "Renders a canvas-based circular progress meter showing threat level percentage with color-coded gradients based on risk level (Low/Medium/High).",
  "frontend/src/components/ThreeSceneAccent.tsx": "Displays a 3D rotating torus wireframe using Three.js and React Three Fiber as a decorative accent element.",
  "frontend/src/components/TransmissionAnimation.tsx": "Shows a simple animated transmission indicator with a pulsing icon and progress bar to simulate data transmission.",
  "frontend/src/hooks/useActor.ts": "Manages backend actor creation with Internet Identity authentication, using React Query to cache and invalidate actor instances when identity changes.",
  "frontend/src/hooks/useAppearancePreferences.ts": "Manages user appearance preferences (reduced motion, density) with localStorage persistence and DOM attribute application for styling.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useOnboarding.ts": "React hook managing onboarding modal state with localStorage persistence, providing functions to dismiss, open, and reset the onboarding flow.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook for backend queries; currently empty as all state is managed client-side via useSimulationState.",
  "frontend/src/hooks/useSimulationState.ts": "Zustand store managing keylogger simulation state including keystroke capture, risk level calculation, AV scanning, auto-blocking, and configurable settings with input validation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for dark theme, glassmorphism effects, density modes, and critical pointer-events utilities for layered UI elements.",
  "frontend/src/lib/customScenarioVideos.ts": "Empty file, likely intended for custom scenario video configuration.",
  "frontend/src/lib/inputSanitizer.ts": "Input sanitization utilities providing HTML escaping, tag removal, and validation to prevent XSS attacks on keystroke input.",
  "frontend/src/lib/reportGenerator.ts": "Generates downloadable text reports summarizing simulation results with peak risk, scan counts, captured keystrokes, and cybersecurity prevention tips.",
  "frontend/src/lib/scenarioLearningContent.ts": "Educational content definitions for different risk scenarios (low/medium/high risk, password patterns, rapid typing, sensitive keywords) explaining keylogger detection patterns and defense strategies.",
  "frontend/src/lib/scenarioQuizzes.ts": "Defines quiz data structures (QuizQuestion, ScenarioQuiz) and exports a record of educational quizzes for each test scenario with 5 questions, multiple-choice options, correct answers, and explanations.",
  "frontend/src/lib/scenarios.ts": "Single source of truth defining TestScenario interface and TEST_SCENARIOS array with 11 scenarios (low-risk to auto-block triggers) including simulated text, descriptions, and helper functions to retrieve scenarios by ID.",
  "frontend/src/lib/scenarioVideos.ts": "Empty file, likely intended for video demonstration configuration or YouTube links for scenario-based educational content.",
  "frontend/src/lib/storageEncryption.ts": "Provides Web Crypto API-based AES-GCM encryption/decryption utilities for localStorage data with session-scoped key management stored in sessionStorage.",
  "frontend/src/main.tsx": "React application entry point that sets up QueryClient, InternetIdentityProvider, and renders the root App component.",
  "frontend/src/pages/AwarenessPage.tsx": "Educational page component displaying keylogger awareness content including hero section, explanations of what keyloggers are, types (hardware/software), animated infographics, quiz component, and prevention strategies.",
  "frontend/src/pages/DashboardPage.tsx": "Main interactive dashboard page orchestrating multiple components including simulated keylogger module, attacker dashboard, AI risk detector, antivirus scanner, test scenarios panel, onboarding overlay, and admin controls with reset functionality.",
  "frontend/src/smoke/PROD_SMOKE_CHECK.md": "Comprehensive manual testing checklist for production deployment verification covering page loads, onboarding flow, help tooltips, reset functionality, test scenarios, quiz interactions, navigation, and footer attribution.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color schemes using OKLCH color space, extended theme utilities including border radius, box shadows with glow effects, and keyframe animations for accordions, shimmer, and glow effects.",
  "project_state.json": "Project state tracking file documenting a security audit and bug fix project with 8 existing features addressing authentication vulnerabilities, XSS issues, localStorage security, state manipulation, accessibility, error boundaries, memory leaks, and performance issues, plus 2 pending feature requests for backend authorization and race condition fixes."
}