{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report listing implemented YouTube preview and validation features with associated files and metadata.",
  "frontend-file-summaries.txt": "Text file containing autogenerated summaries of multiple frontend components and utilities.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme variables and base styling.",
  "frontend/index.html": "HTML entry point providing root element and loading the React app.",
  "frontend/src/App.tsx": "Sets up routing, theme provider, and global toaster for the React application.",
  "frontend/src/components/AdminDemoModeToggle.tsx": "Toggle button enabling or disabling the simulated attacker dashboard view.",
  "frontend/src/components/AIRiskDetectorPanel.tsx": "AI risk panel displaying threat meter, typing metrics, and heuristic-based risk visuals.",
  "frontend/src/components/AnimatedInfographics.tsx": "Canvas-based animated overlay drawn over a static infographic image.",
  "frontend/src/components/AttackerDashboardPanel.tsx": "Simulated attacker view showing captured keystrokes, reconstructed text, and optional transmission animation.",
  "frontend/src/components/AttackSimulationTimeline.tsx": "Timeline showing staged progression of simulated keylogger attack events.",
  "frontend/src/components/AutoBlockingAlert.tsx": "Shows an alert when auto-blocking is triggered and provides info plus a reset button.",
  "frontend/src/components/AwarenessQuiz.tsx": "Implements a multi‑question cybersecurity quiz with scoring, explanations, and completion state.",
  "frontend/src/components/DisclaimerBanner.tsx": "Displays an educational‑use disclaimer explaining that the simulation is local and safe.",
  "frontend/src/components/HelpTooltip.tsx": "Wraps children with a tooltip component showing contextual help text.",
  "frontend/src/components/InContextWarning.tsx": "Renders a small warning box with an info icon and a provided message.",
  "frontend/src/components/Layout.tsx": "Defines the main app layout including header navigation, background, and mobile menu.",
  "frontend/src/components/ModuleInfoPopover.tsx": "Provides an info button with optional tooltip and a popover showing module details.",
  "frontend/src/components/OnboardingOverlay.tsx": "Implements a multi‑step onboarding guide introducing app features and usage.",
  "frontend/src/components/ReportGeneratorButton.tsx": "Generates and downloads a local simulation report and shows toast notifications.",
  "frontend/src/components/RotatingDashboardCard.tsx": "Creates a 3D‑tilting dashboard card effect based on mouse movement.",
  "frontend/src/components/ScenarioVideoModal.tsx": "Modal component that displays scenario demo videos with YouTube embed handling and accessibility-focused focus management.",
  "frontend/src/components/SimulatedAntivirusScanner.tsx": "Visual antivirus simulation UI showing scan states, detection info, and actions like quarantine or removal.",
  "frontend/src/components/SimulatedCounters.tsx": "Displays counters for keystrokes, scans, and blocks based on simulation state.",
  "frontend/src/components/SimulatedKeyloggerModule.tsx": "Simulated keylogger input box that captures typed text and reacts to block state.",
  "frontend/src/components/SimulationSettingsPanel.tsx": "Settings panel allowing users to adjust local simulation options such as auto-blocking and scan duration.",
  "frontend/src/components/TestScenariosPanel.tsx": "Interface for running predefined or custom simulation scenarios and previewing associated videos.",
  "frontend/src/components/ThreatMeter3D.tsx": "Canvas-based 3D-style threat meter that visualizes risk level and percentage with animated drawing.",
  "frontend/src/components/ThreeSceneAccent.tsx": "Three.js accent scene rendering a rotating ring with orbit controls for visual enhancement.",
  "frontend/src/components/TransmissionAnimation.tsx": "Simple animated UI element indicating simulated data transmission activity.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor via React Query, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useOnboarding.ts": "Manages onboarding modal state using localStorage to track dismissal and expose open/reset actions.",
  "frontend/src/hooks/useQueries.ts": "Stub hook returning no backend queries since the simulation is fully client-side.",
  "frontend/src/hooks/useSimulationState.ts": "Zustand store managing keystroke capture, risk detection, AV simulation, blocking logic, and configurable settings.",
  "frontend/src/index.css": "Tailwind-based global styles defining theme variables, utility classes, and custom animations.",
  "frontend/src/lib/customScenarioVideos.ts": "Handles localStorage persistence and validation of custom per-scenario YouTube video links.",
  "frontend/src/lib/reportGenerator.ts": "Builds a text-based simulation report and triggers its download as a file.",
  "frontend/src/lib/scenarioVideos.ts": "Provides static scenario-to-YouTube mappings and utilities to resolve embed URLs.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and Internet Identity providers.",
  "frontend/src/pages/AwarenessPage.tsx": "Renders an educational page explaining keyloggers, their types, and prevention tips using structured sections and visual components.",
  "frontend/src/pages/DashboardPage.tsx": "Builds an interactive simulation dashboard with onboarding, keylogger demo modules, attacker panel, risk detection, counters, and reset/help controls.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme extensions, colors, animations, plugins, and content paths.",
  "project_state.json": "Defines the project's overall state, constraints, features, known issues, and architectural guidelines for the keylogger awareness tool."
}