{
  "backend/main.mo": "Minimal Motoko actor with no functionality.",
  "feature_evidence.json": "Feature evidence report mapping new scenario and preset-text updates to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files including components, hooks, and utilities used across the app.",
  "frontend/index.css": "Tailwind CSS base and theme variable definitions for light and dark modes with color tokens and layout defaults.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, theme provider, and global toaster notifications.",
  "frontend/src/components/AdminDemoModeToggle.tsx": "Toggle button enabling or disabling attacker demo mode using simulation state.",
  "frontend/src/components/AIRiskDetectorPanel.tsx": "Displays simulated AI risk metrics using heuristics, meters, and pattern analysis values from state.",
  "frontend/src/components/AnimatedInfographics.tsx": "Canvas‑based animated overlay combined with a static infographic image for visual data‑flow effects.",
  "frontend/src/components/AttackerDashboardPanel.tsx": "Shows simulated attacker view including captured keystrokes, reconstructed text, and optional transmission animation.",
  "frontend/src/components/AttackSimulationTimeline.tsx": "Renders a five‑stage attack timeline with icons and active‑stage indicators based on simulation state.",
  "frontend/src/components/AutoBlockingAlert.tsx": "Displays an alert when auto-blocking is active and allows the user to reset the simulation.",
  "frontend/src/components/AwarenessQuiz.tsx": "Implements a multi‑question cybersecurity quiz with scoring, explanations, and completion handling.",
  "frontend/src/components/DisclaimerBanner.tsx": "Shows a banner explaining the simulation’s educational nature and data‑privacy assurances.",
  "frontend/src/components/HelpTooltip.tsx": "Wraps content with a tooltip trigger and displays informational text on hover.",
  "frontend/src/components/InContextWarning.tsx": "Renders a small warning message with an info icon for contextual notices.",
  "frontend/src/components/Layout.tsx": "Provides the main page layout with header, navigation, background, and disclaimer banner.",
  "frontend/src/components/ModuleInfoPopover.tsx": "Displays an info button that opens a popover with module details and optional tooltip.",
  "frontend/src/components/OnboardingOverlay.tsx": "Implements a multi‑step onboarding overlay guiding users through tool features.",
  "frontend/src/components/ReportGeneratorButton.tsx": "Button that generates a downloadable local report using the current simulation state.",
  "frontend/src/components/RotatingDashboardCard.tsx": "A card component that tilts on mouse movement for an interactive 3D effect.",
  "frontend/src/components/ScenarioQuiz.tsx": "Interactive quiz component handling question navigation, answer selection, explanations, scoring, and retry flow.",
  "frontend/src/components/ScenarioQuizModal.tsx": "Modal wrapper for displaying scenario quizzes with focus management, escape handling, and fallback when quiz data is missing.",
  "frontend/src/components/ScenarioVideoModal.tsx": "Empty placeholder file for a scenario video modal component.",
  "frontend/src/components/SimulatedAntivirusScanner.tsx": "Visual simulated antivirus scanner showing scan states, threat detection, and quarantine/remove actions driven by simulation state.",
  "frontend/src/components/SimulatedCounters.tsx": "Displays live counters for keystrokes, scan count, and block count from the simulation state.",
  "frontend/src/components/SimulatedKeyloggerModule.tsx": "Simulated keylogger input box capturing typed text, showing warnings, and blocking input when flagged by simulation state.",
  "frontend/src/components/SimulationSettingsPanel.tsx": "Settings panel allowing users to adjust simulation behavior such as auto-blocking, animations, and scan duration.",
  "frontend/src/components/TestScenariosPanel.tsx": "UI for running predefined scenarios, viewing learning content, and launching scenario quizzes with modal support.",
  "frontend/src/components/ThreatMeter3D.tsx": "Canvas-based circular threat meter rendering percentage and risk level with gradient arcs.",
  "frontend/src/components/ThreeSceneAccent.tsx": "Three.js scene rendering a rotating torus ring with ambient lighting and orbit controls.",
  "frontend/src/components/TransmissionAnimation.tsx": "UI element showing a pulsing send icon and progress bar for simulated transmission.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity auth client, login flow, and stored identities.",
  "frontend/src/hooks/useOnboarding.ts": "Tracks onboarding visibility using localStorage and provides open/dismiss/reset actions.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook returning no queries for a fully client-side simulation.",
  "frontend/src/hooks/useSimulationState.ts": "Zustand store managing simulation input, risk scoring, AV actions, blocking logic, and settings.",
  "frontend/src/index.css": "Tailwind setup with custom theme variables, component styles, utilities, and animations.",
  "frontend/src/lib/customScenarioVideos.ts": "Empty module placeholder for custom scenario video handling.",
  "frontend/src/lib/reportGenerator.ts": "Generates a text report summarizing simulation data and triggers file download as a text blob.",
  "frontend/src/lib/scenarioLearningContent.ts": "Defines scenario content structures and provides educational text for multiple risk-level typing scenarios. Used to display defensive, awareness-focused information for each test scenario.",
  "frontend/src/lib/scenarioQuizzes.ts": "Defines quiz structures and supplies multiple-choice quiz data for each scenario. Provides educational, defensive explanations tied to scenario content.",
  "frontend/src/lib/scenarioVideos.ts": "Placeholder module for scenario-related videos with no implemented content.",
  "frontend/src/main.tsx": "Initializes the React app with Internet Identity and React Query providers. Renders the main App component into the root DOM node.",
  "frontend/src/pages/AwarenessPage.tsx": "Renders an informational page explaining keyloggers, their types, and prevention tips. Includes infographics and an awareness quiz.",
  "frontend/src/pages/DashboardPage.tsx": "Implements the interactive keylogger simulation dashboard with panels, onboarding, risk tools, and admin/demo features. Coordinates layout and user controls for the simulation environment.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, animations, typography, and plugin integrations. Defines theme extensions and content scanning paths.",
  "project_state.json": "Tracks project metadata, existing features, new feature requests, and development state. Describes current goals related to adding a new practical scenario workflow."
}