{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend entry point.",
  "feature_evidence.json": "Feature evidence report documenting security enhancements including input sanitization, CSP implementation, localStorage encryption with key rotation, rate limiting, and comprehensive state validation across frontend components.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files describing components, hooks, utilities, and their security features, accessibility implementations, and simulation behaviors.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining color schemes, spacing, and design tokens for both light and dark themes using OKLCH color space.",
  "frontend/index.html": "HTML entry point with Content Security Policy meta tag restricting script sources, allowing YouTube embeds, and blocking unsafe inline scripts and eval.",
  "frontend/src/App.tsx": "Root application component configuring React Router, React Query, theme provider, error boundary, and applying accessibility preferences (reduced motion, density) to the DOM.",
  "frontend/src/components/AdminDemoModeToggle.tsx": "Toggle button component for switching attacker dashboard view on/off with proper ARIA pressed state and tooltip explaining demo-only local visualization.",
  "frontend/src/components/AIRiskDetectorPanel.tsx": "AI risk detection panel displaying threat meter, risk level indicators with progress bars, and ARIA live region announcing significant risk level changes for screen reader accessibility.",
  "frontend/src/components/AnimatedInfographics.tsx": "Canvas-based animation component rendering animated data flow lines over a keylogger types infographic with proper cleanup of animation frames.",
  "frontend/src/components/AppearanceExperiencePanel.tsx": "A settings panel component that allows users to toggle dark mode, reduced motion, and layout density preferences using the theme and appearance preferences hooks.",
  "frontend/src/components/AttackerDashboardPanel.tsx": "Simulates an attacker's view showing captured keystrokes and reconstructed text with transmission animations, sanitizing all displayed input and providing screen reader announcements.",
  "frontend/src/components/AttackSimulationTimeline.tsx": "Displays a visual timeline of five attack stages (User Types, Keylogger Captures, Data Transmitted, Antivirus Detects, Threat Blocked) with progress indicators based on simulation state.",
  "frontend/src/components/AutoBlockingAlert.tsx": "Displays an animated alert when the simulation auto-blocks high-risk activity, with a reset button to continue the demo.",
  "frontend/src/components/AwarenessQuiz.tsx": "An interactive quiz component with five multiple-choice questions about keyloggers, showing explanations, tracking scores, and providing navigation to restart or return to dashboard.",
  "frontend/src/components/DashboardHeroIntro.tsx": "A hero section component with background image, heading, description, and quick start guide explaining the educational security simulation tool.",
  "frontend/src/components/DisclaimerBanner.tsx": "A prominent banner displaying an educational disclaimer that clarifies the tool runs locally in the browser without capturing, storing, or transmitting real data.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches and displays errors with a fallback UI, showing error details in development mode and providing reset/refresh options.",
  "frontend/src/components/HelpTooltip.tsx": "Reusable tooltip component that wraps children with a hover/focus tooltip displaying help text, with configurable positioning (side and alignment).",
  "frontend/src/components/InContextWarning.tsx": "Simple warning banner component that displays an info icon with a message in a styled container with teal accent colors.",
  "frontend/src/components/Layout.tsx": "Main application layout with header navigation, cyber-themed background decoration, disclaimer banner, and responsive mobile menu for Dashboard and Awareness pages.",
  "frontend/src/components/ModuleInfoPopover.tsx": "Info button component that toggles a popover with module title and description, optionally wrapped in a HelpTooltip for additional context.",
  "frontend/src/components/OnboardingOverlay.tsx": "Multi-step onboarding overlay that guides users through the keylogger awareness tool features with navigation controls, explaining demo input, attacker view, risk detection, and test scenarios.",
  "frontend/src/components/ReportGeneratorButton.tsx": "Button component that generates and downloads a local PDF/text report of the simulation state including captured keystrokes, risk metrics, and scan counts using the reportGenerator utility.",
  "frontend/src/components/RotatingDashboardCard.tsx": "Interactive card wrapper that applies 3D rotation effects based on mouse position, creating a tilting hover effect with perspective transforms.",
  "frontend/src/components/ScenarioQuiz.tsx": "Multi-question quiz component with answer selection, immediate feedback with explanations, progress tracking, and completion summary showing score and review of all answers.",
  "frontend/src/components/ScenarioQuizModal.tsx": "Modal component that displays a scenario-based quiz with accessibility features (focus management, keyboard navigation, ARIA attributes). Fetches quiz content by scenario ID and handles open/close state with proper cleanup.",
  "frontend/src/components/ScenarioVideoModal.tsx": "Empty file with no content.",
  "frontend/src/components/SimulatedAntivirusScanner.tsx": "Simulated antivirus scanner UI that displays scanning states (idle, scanning, detected, quarantined, removed) with visual feedback and screen reader announcements. Provides buttons to start scans and manage detected threats.",
  "frontend/src/components/SimulatedCounters.tsx": "Dashboard component displaying three metrics (keystrokes captured, scans performed, blocks executed) in a grid layout using data from the simulation state hook.",
  "frontend/src/components/SimulatedKeyloggerModule.tsx": "Educational keylogger simulation with a textarea input that captures keystrokes locally. Displays warnings, rate limit alerts, and blocked states while emphasizing that no data is transmitted to servers.",
  "frontend/src/components/SimulationSettingsPanel.tsx": "Empty file with no content.",
  "frontend/src/components/TestScenariosPanel.tsx": "Panel displaying test scenarios in a grid with collapsible content, learning materials, and quiz buttons. Includes keyboard navigation (arrow keys, Enter, Escape) and reset functionality for the simulation.",
  "frontend/src/components/ThreatMeter3D.tsx": "Canvas-based circular threat meter that visualizes risk level and percentage using animated arcs with color gradients (green for low, yellow for medium, red for high). Renders percentage and level text in the center.",
  "frontend/src/components/ThreeSceneAccent.tsx": "Three.js decorative component rendering a rotating wireframe torus with proper resource cleanup (geometry, material, WebGL context disposal). Uses React Three Fiber with orbit controls.",
  "frontend/src/components/TransmissionAnimation.tsx": "Simple animated UI component showing a simulated data transmission with a pulsing send icon and progress bar.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAppearancePreferences.ts": "React hook that manages user appearance preferences (reduced motion, density) with localStorage persistence, validation, and DOM attribute application for styling.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and delegation validation using @dfinity/auth-client.",
  "frontend/src/hooks/useOnboarding.ts": "React hook that manages onboarding modal state with localStorage persistence to track whether the user has dismissed the initial awareness tutorial.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder hook for backend queries; all state management is handled client-side via useSimulationState.",
  "frontend/src/hooks/useSimulationState.ts": "Zustand store managing the keylogger awareness simulation state including keystroke capture, risk levels, AV status, rate limiting, input validation, and configurable settings with comprehensive validation helpers.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for dark theme, cyber accent colors, density modes (comfortable/compact), glassmorphism utilities, and dashboard layout classes.",
  "frontend/src/lib/customScenarioVideos.ts": "Empty file, likely intended for custom scenario video configuration.",
  "frontend/src/lib/inputSanitizer.ts": "Comprehensive XSS prevention utilities with pattern detection for script tags, event handlers, and dangerous protocols, providing HTML escaping, tag removal, and multi-layer keystroke sanitization.",
  "frontend/src/lib/reportGenerator.ts": "Generates a downloadable text report summarizing keylogger simulation results, including peak risk level, scan/block counts, captured keystrokes, reconstructed text, and educational prevention tips with disclaimers.",
  "frontend/src/lib/scenarioLearningContent.ts": "Defines educational content for each test scenario (low/medium/high risk, password patterns, rapid typing, sensitive keywords) explaining the security implications and defensive best practices.",
  "frontend/src/lib/scenarioQuizzes.ts": "Contains quiz questions with multiple-choice options, correct answers, and explanations for each test scenario to reinforce security awareness learning.",
  "frontend/src/lib/scenarios.ts": "Defines all test scenarios with IDs, names, descriptions, expected outcomes, and simulated text strings; serves as the single source of truth for scenario data across the application.",
  "frontend/src/lib/scenarioVideos.ts": "Empty file, likely intended for video content related to test scenarios.",
  "frontend/src/lib/storageEncryption.ts": "Implements AES-GCM encryption with HMAC integrity verification for secure local storage, using Web Crypto API with session-based key rotation and versioned payloads.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/AwarenessPage.tsx": "Renders the educational awareness page with sections explaining what keyloggers are, types of keyloggers (hardware/software), animated infographics, and includes an awareness quiz component.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page component that orchestrates the keylogger awareness simulation UI, including onboarding overlay, help tooltips, reset functionality, and multiple interactive panels (keylogger module, attacker dashboard, AI risk detector, antivirus scanner, timeline, test scenarios).",
  "frontend/src/smoke/PROD_SMOKE_CHECK.md": "Comprehensive manual testing checklist for production deployment verification, covering page load, onboarding flow, help tooltips, reset functionality, test scenarios, awareness page quiz, navigation, and footer attribution with specific test IDs for each component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color palette using OKLCH color space, extended border radius values, custom box shadows (including glow effects), and keyframe animations for accordion, pulse, shimmer, and glow effects.",
  "project_state.json": "Project state tracking document listing completed security improvements including input sanitization, CSP implementation, localStorage encryption with key rotation, rate limiting, state validation, and accessibility enhancements with ARIA live regions and keyboard navigation."
}