{
  "kind": "build_request",
  "title": "Add a more useful, real-world “Run Scenario” workflow",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a new, practical test scenario that is clearly related to the app’s keylogger-awareness simulation (e.g., a real-world “public/shared computer login” style scenario) and make it available from the existing “Test Scenarios” panel with working “Run Scenario”, learning content, and quiz support.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add run scenario with something usefula nd related to it"
        ]
      },
      "acceptanceCriteria": [
        "A new scenario appears in the existing Test Scenarios list (frontend/src/components/TestScenariosPanel.tsx) with a name, short description, and expected outcome.",
        "Clicking “Run Scenario” on the new scenario triggers the existing runScenario flow (frontend/src/hooks/useSimulationState.ts) and visibly plays back the scenario text into the simulation input (no manual typing required).",
        "The scenario has associated learning content returned by getScenarioContent (frontend/src/lib/scenarioLearningContent.ts) and it renders correctly in the collapsible learning-content section.",
        "The scenario has an associated quiz entry (frontend/src/lib/scenarioQuizzes.ts) and clicking “Take Test” opens the quiz modal for that scenario without errors."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the scenario runner’s preset text for the newly added scenario to be educational, defensive, and privacy-safe (no real credentials; avoid providing instructions that enable wrongdoing), while still being realistic enough to demonstrate risk scoring/auto-blocking behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add run scenario with something usefula nd related to it"
        ]
      },
      "acceptanceCriteria": [
        "The new scenario’s preset text is included in the runScenario mapping in frontend/src/hooks/useSimulationState.ts.",
        "The preset text does not include real-looking secrets (e.g., actual credit card/SSN formats) and stays in a defensive/awareness tone.",
        "Running the scenario produces a non-trivial outcome in the simulation (e.g., Medium/High risk or auto-block if enabled), consistent with the scenario’s “Expected” label shown in the UI."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (read-only components must only be composed).",
    "Do not edit immutable hook files listed in SYSTEM_CONTEXT.frontend.immutablePaths.",
    "Backend must remain single-actor; do not add additional canisters/services."
  ],
  "nonGoals": [
    "Do not add real-time networking, data exfiltration, or any functionality that captures/transmits real user keystrokes.",
    "Do not implement third-party auth providers; keep authentication limited to Internet Identity (if used at all).",
    "Do not introduce a database or any external persistence service."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}