{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Preview unsaved custom per-scenario YouTube links in ScenarioVideoModal",
  "requirements": [
    {
      "id": "REQ-46",
      "summary": "Add a per-scenario Preview control in the Custom YouTube Video config to open ScenarioVideoModal for the current unsaved input without persisting.",
      "acceptanceCriteria": [
        "Each scenario’s expanded configuration area includes a clearly labeled \"Preview\" control next to the existing \"Save\" control.",
        "Clicking \"Preview\" opens the existing ScenarioVideoModal and plays the video resolved from the current input value for that scenario (even if it has not been saved).",
        "If the input is empty or invalid, \"Preview\" does not open the modal and the user sees an English validation message (reusing the existing validation error UI pattern).",
        "Previewing a link does not write anything to localStorage and does not change which video will play via the scenario’s main Play button until the user clicks \"Save\".",
        "Closing the modal restores keyboard focus to the element that opened the preview (consistent with current modal focus behavior)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TestScenariosPanel.tsx",
          "operation": "modify",
          "description": "Add a \"Preview\" Button next to the existing \"Save\" Button within each expanded scenario configuration. Implement a preview click handler that (1) reads the current per-scenario input value, (2) validates it using the existing YouTube validation utility, (3) if valid sets modal state to open ScenarioVideoModal with videoSrc derived from the current unsaved input (without calling saveCustomVideo / without updating the saved customVideos map), and (4) if empty/invalid sets validationErrors using the same UI pattern already used for Save. Ensure modal close uses existing close flow so focus returns to the preview-triggering button per current modal behavior."
        }
      ]
    },
    {
      "id": "REQ-47",
      "summary": "Reuse existing YouTube validation and embed-resolution rules for preview, keep English-only UI text, and avoid any backend involvement.",
      "acceptanceCriteria": [
        "The preview action uses the existing validation logic (e.g., validateYouTubeUrl / getYouTubeEmbedUrl behavior) so any link that can be previewed is also eligible to be saved.",
        "The ScenarioVideoModal continues to show a graceful English fallback message if the provided input cannot be converted to an embed URL or if the iframe fails to load.",
        "No backend calls or new backend functionality are introduced for previewing or saving custom links."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TestScenariosPanel.tsx",
          "operation": "modify",
          "description": "Ensure the Preview handler relies on the existing validateYouTubeUrl logic (from customScenarioVideos) and passes the raw URL/video ID into ScenarioVideoModal (so embed conversion uses the same getYouTubeEmbedUrl rules as playback). Confirm all new/updated user-facing validation messages are in English and that preview introduces no backend calls."
        },
        {
          "path": "frontend/src/components/ScenarioVideoModal.tsx",
          "operation": "modify",
          "description": "Adjust modal fallback messaging (English) to gracefully cover both cases: (1) when a provided videoSrc cannot be converted to an embed URL (invalid/unsupported input) and (2) when the iframe fails to load after an embed URL is produced. Keep existing focus-management behavior intact."
        }
      ]
    }
  ]
}