{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add real-world public/shared computer login scenario to Run Scenario workflow",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a new real-world keylogger-awareness scenario to the existing Test Scenarios panel with working Run Scenario, learning content, and quiz support.",
      "acceptanceCriteria": [
        "A new scenario appears in the existing Test Scenarios list (frontend/src/components/TestScenariosPanel.tsx) with a name, short description, and expected outcome.",
        "Clicking “Run Scenario” on the new scenario triggers the existing runScenario flow (frontend/src/hooks/useSimulationState.ts) and visibly plays back the scenario text into the simulation input (no manual typing required).",
        "The scenario has associated learning content returned by getScenarioContent (frontend/src/lib/scenarioLearningContent.ts) and it renders correctly in the collapsible learning-content section.",
        "The scenario has an associated quiz entry (frontend/src/lib/scenarioQuizzes.ts) and clicking “Take Test” opens the quiz modal for that scenario without errors."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TestScenariosPanel.tsx",
          "operation": "modify",
          "description": "Add a new scenario entry (e.g., id like \"public-shared-computer-login\") to the existing scenarios array with name, short description, and Expected label so it appears in the current Test Scenarios grid. This will continue to use existing shadcn-ui Button and Collapsible compositions for learning content and actions. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/lib/scenarioLearningContent.ts",
          "operation": "modify",
          "description": "Add a ScenarioContent entry keyed by the new scenario id, with a defensive, awareness-focused title and content tailored to a public/shared computer login context so getScenarioContent returns it and the existing collapsible section renders it."
        },
        {
          "path": "frontend/src/lib/scenarioQuizzes.ts",
          "operation": "modify",
          "description": "Add a ScenarioQuiz entry keyed by the new scenario id (5 questions) so getScenarioQuiz can supply quiz content and ScenarioQuizModal opens without errors when \"Take Test\" is clicked."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Provide educational, privacy-safe preset text for the new scenario that still produces a meaningful risk/auto-block outcome when run.",
      "acceptanceCriteria": [
        "The new scenario’s preset text is included in the runScenario mapping in frontend/src/hooks/useSimulationState.ts.",
        "The preset text does not include real-looking secrets (e.g., actual credit card/SSN formats) and stays in a defensive/awareness tone.",
        "Running the scenario produces a non-trivial outcome in the simulation (e.g., Medium/High risk or auto-block if enabled), consistent with the scenario’s “Expected” label shown in the UI."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useSimulationState.ts",
          "operation": "modify",
          "description": "Extend the existing runScenario scenarios mapping with the new scenario id and preset playback text that is realistic but privacy-safe (no real credentials), using password-like patterns/keywords to reliably trigger Medium/High risk and (if enabled) auto-block during the existing character-by-character playback flow."
        }
      ]
    }
  ]
}